SoapAPI/src/test/resources/deleteBook.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:api="http://api.soap.it.p.lodz.pl/">
    <soapenv:Header/>
    <soapenv:Body>
        <api:removeSingleBookFromStorage>
            <!--Optional:-->
            <arg0>testArg0</arg0>
        </api:removeSingleBookFromStorage>
    </soapenv:Body>
</soapenv:Envelope>